app/views/foodtrucks/show.html.erb


<h3>Messages (<%= @foodtruck.messages.size %>)</h3>
---
SELECT "messages".* FROM "messages" WHERE "messages"."foodtruck_id" = $1  [["foodtruck_id", 10]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."foodtruck_id" = $1  [["foodtruck_id", 12]]


<h3>Reviews (<%= @foodtruck.reviews.size %>)</h3>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."foodtruck_id" = $1  [["foodtruck_id", 12]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."foodtruck_id" = $1  [["foodtruck_id", 12]]