app/controllers/foodtrucks_controller.rb

  def index
    @foodtrucks = Foodtruck.all
---
SELECT "foodtrucks".* FROM "foodtrucks"

  def show
    @foodtruck = Foodtruck.find(params[:id])
---
SELECT  "foodtrucks".* FROM "foodtrucks" WHERE "foodtrucks"."id" = $1 LIMIT 1  [["id", 0]]

  def create
    @foodtruck = Foodtruck.create(foodtruck_params)
---
INSERT INTO "foodtrucks" ("name", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Eddie's Pizza"], ["img_url", ""], ["created_at", "2015-11-07 03:37:18.343845"], ["updated_at", "2015-11-07 03:37:18.343845"]]

  def edit
    @foodtruck = Foodtruck.find(params[:id])
    @message = Message.find_by(foodtruck: params[:id])
---
SELECT  "foodtrucks".* FROM "foodtrucks" WHERE "foodtrucks"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "messages".* FROM "messages" WHERE "messages"."foodtruck_id" = 18 LIMIT 1

  def update
    @foodtruck = Foodtruck.find(params[:id])
    @foodtruck.update(foodtruck_params)
---
SELECT  "foodtrucks".* FROM "foodtrucks" WHERE "foodtrucks"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "foodtrucks" SET "card" = $1, "menu" = $2, "updated_at" = $3 WHERE "foodtrucks"."id" = $4  [["card", "Yes"], ["menu", "Chee"], ["updated_at", "2015-11-07 17:46:15.898417"], ["id", 2]]

  def destroy
    @foodtruck = Foodtruck.find(params[:id])
    @foodtruck.destroy
---
SELECT  "foodtrucks".* FROM "foodtrucks" WHERE "foodtrucks"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "foodtrucks" WHERE "foodtrucks"."id" = $1  [["id", 4]]