app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "foodtruck_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "At Madison Square Eats"], ["foodtruck_id", 10], ["created_at", "2015-11-07 19:42:52.432350"], ["updated_at", "2015-11-07 19:42:52.432350"]]
---
  def create
    @message = Message.new(message_params)
    @message.foodtruck_id = params[:foodtruck_id]

    @message.save