app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("author", "rating", "message", "foodtruck_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author", "Noah"], ["rating", 5], ["message", "Hello"], ["foodtruck_id", 12], ["created_at", "2015-11-08 05:50:32.478878"], ["updated_at", "2015-11-08 05:50:32.478878"]]
---
  def create
    @review = Review.new(review_params)
    @review.foodtruck_id = params[:foodtruck_id]

    @review.save