app/controllers/sessions_controller.rb

  def create
    username = params[:username]
    password = params[:password]
    vendor = Vendor.find_by({username: username})
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."username" = $1 LIMIT 1  [["username", "noah"]]